bench/trimbench/res.xfs.discard.samsung980pro.linux65.amd2/o.test.out
nohup: ignoring input
Create /data/m/f.1 at Tue Jun 18 06:45:49 PM UTC 2024
524288+0 records in
524288+0 records out
549755813888 bytes (550 GB, 512 GiB) copied, 2690.11 s, 204 MB/s
-rw-rw-r-- 1 mdcallag mdcallag 512G Jun 18 19:30 /data/m/f.1
Sleep for 30 seconds after creating /data/m/f.1 at Tue Jun 18 07:30:40 PM UTC 2024
Existing /data/m/f.2 is large enough
List kernel
Linux amd2 6.5.0-35-generic #35~22.04.1-Ubuntu SMP PREEMPT_DYNAMIC Tue May  7 09:00:52 UTC 2 x86_64 x86_64 x86_64 GNU/Linux
List mount options for filesystems
sysfs on /sys type sysfs (rw,nosuid,nodev,noexec,relatime)
proc on /proc type proc (rw,nosuid,nodev,noexec,relatime)
udev on /dev type devtmpfs (rw,nosuid,relatime,size=7817932k,nr_inodes=1954483,mode=755,inode64)
devpts on /dev/pts type devpts (rw,nosuid,noexec,relatime,gid=5,mode=620,ptmxmode=000)
tmpfs on /run type tmpfs (rw,nosuid,nodev,noexec,relatime,size=1576708k,mode=755,inode64)
efivarfs on /sys/firmware/efi/efivars type efivarfs (rw,nosuid,nodev,noexec,relatime)
/dev/sda2 on / type ext4 (rw,relatime)
securityfs on /sys/kernel/security type securityfs (rw,nosuid,nodev,noexec,relatime)
tmpfs on /dev/shm type tmpfs (rw,nosuid,nodev,inode64)
tmpfs on /run/lock type tmpfs (rw,nosuid,nodev,noexec,relatime,size=5120k,inode64)
cgroup2 on /sys/fs/cgroup type cgroup2 (rw,nosuid,nodev,noexec,relatime,nsdelegate,memory_recursiveprot)
pstore on /sys/fs/pstore type pstore (rw,nosuid,nodev,noexec,relatime)
bpf on /sys/fs/bpf type bpf (rw,nosuid,nodev,noexec,relatime,mode=700)
systemd-1 on /proc/sys/fs/binfmt_misc type autofs (rw,relatime,fd=29,pgrp=1,timeout=0,minproto=5,maxproto=5,direct,pipe_ino=15920)
hugetlbfs on /dev/hugepages type hugetlbfs (rw,relatime,pagesize=2M)
mqueue on /dev/mqueue type mqueue (rw,nosuid,nodev,noexec,relatime)
debugfs on /sys/kernel/debug type debugfs (rw,nosuid,nodev,noexec,relatime)
tracefs on /sys/kernel/tracing type tracefs (rw,nosuid,nodev,noexec,relatime)
fusectl on /sys/fs/fuse/connections type fusectl (rw,nosuid,nodev,noexec,relatime)
configfs on /sys/kernel/config type configfs (rw,nosuid,nodev,noexec,relatime)
ramfs on /run/credentials/systemd-sysusers.service type ramfs (ro,nosuid,nodev,noexec,relatime,mode=700)
/var/lib/snapd/snaps/core20_2264.snap on /snap/core20/2264 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/core20_2318.snap on /snap/core20/2318 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/lxd_27948.snap on /snap/lxd/27948 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/lxd_28373.snap on /snap/lxd/28373 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/snapd_21465.snap on /snap/snapd/21465 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/snapd_21759.snap on /snap/snapd/21759 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/dev/sda1 on /boot/efi type vfat (rw,relatime,fmask=0022,dmask=0022,codepage=437,iocharset=iso8859-1,shortname=mixed,errors=remount-ro)
binfmt_misc on /proc/sys/fs/binfmt_misc type binfmt_misc (rw,nosuid,nodev,noexec,relatime)
tmpfs on /run/snapd/ns type tmpfs (rw,nosuid,nodev,noexec,relatime,size=1576708k,mode=755,inode64)
nsfs on /run/snapd/ns/lxd.mnt type nsfs (rw)
tmpfs on /run/user/1000 type tmpfs (rw,nosuid,nodev,relatime,size=1576704k,nr_inodes=394176,mode=700,uid=1000,gid=1000,inode64)
/dev/nvme0n1 on /data type xfs (rw,noatime,nodiratime,attr2,discard,inode64,logbufs=8,logbsize=32k,noquota)

Remove /data/m/f.1 at Tue Jun 18 07:31:10 PM UTC 2024
Start fio to read from /data/m/f.2 at Tue Jun 18 07:31:10 PM UTC 2024

iops-test-job: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.28
Starting 1 process

iops-test-job: (groupid=0, jobs=1): err= 0: pid=1191: Tue Jun 18 19:32:41 2024
  read: IOPS=87.1k, BW=340MiB/s (357MB/s)(29.9GiB/90001msec)
    slat (nsec): min=3216, max=65624, avg=4465.86, stdev=1644.21
    clat (usec): min=18, max=19222, avg=86.44, stdev=137.57
     lat (usec): min=23, max=19228, avg=91.05, stdev=137.64
    clat percentiles (usec):
     |  1.00th=[   59],  5.00th=[   61], 10.00th=[   62], 20.00th=[   64],
     | 30.00th=[   67], 40.00th=[   69], 50.00th=[   73], 60.00th=[   75],
     | 70.00th=[   78], 80.00th=[   82], 90.00th=[   89], 95.00th=[  105],
     | 99.00th=[  289], 99.50th=[ 1336], 99.90th=[ 1549], 99.95th=[ 1614],
     | 99.99th=[ 2606]
   bw (  KiB/s): min=55544, max=410840, per=99.97%, avg=348155.20, stdev=124885.40, samples=179
   iops        : min=13886, max=102710, avg=87038.84, stdev=31221.37, samples=179
  lat (usec)   : 20=0.01%, 50=0.06%, 100=94.02%, 250=4.84%, 500=0.16%
  lat (usec)   : 750=0.02%, 1000=0.05%
  lat (msec)   : 2=0.82%, 4=0.02%, 10=0.01%, 20=0.01%
  cpu          : usr=16.31%, sys=48.52%, ctx=2073262, majf=1, minf=21
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7835639,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=340MiB/s (357MB/s), 340MiB/s-340MiB/s (357MB/s-357MB/s), io=29.9GiB (32.1GB), run=90001-90001msec

Disk stats (read/write):
  nvme0n1: ios=7825015/11, merge=0/5, ticks=620602/24, in_queue=621959, util=99.95%

run.sh: line 61: kill: (1179) - No such process